# CLIs
brew "git"				# Git (to use the most up-to-date version)
brew "neovim"				# Text editor
brew "tmux"				# Terminal multiplexer
brew "fzf"				# Fuzzy finder 
brew "fd"				# Find alternative to be used with fzf
brew "stow"				# Symlink farm manager. Used by dotfiles
brew "yazi"				# Terminal file manager

brew "zinit"			# Zsh plugin manager
brew "oh-my-posh"	# Powershell theme engine

brew "ffmpeg"			# Video editing

brew "gh"					# GitHub CLI

brew "nvm"				# Node version manager - installs Node.js & npm
brew "pnpm"				# Package manager for Node.js
brew "deno"				# Secure runtime for JavaScript and TypeScript

brew "go"					# Go programming language

# GUI apps (Casks)
cask "ghostty"						# Terminal
cask "itsycal"						# Mini-calendar in menu bar
cask "nikitabobko/tap/aerospace" # Tiling window manager
cask "raycast"						# Spotlight alternative
cask "visual-studio-code"	# Code editor

cask "docker"					# Docker with desktop app

cask "1password"			# Password manager - dektop app
cask "1password-cli"	# Command line interface for 1Password

# Note taking
cask "obsidian"

# Design
cask "figma"			# Design tool
cask "blender"		# 3D modeling

# Browsers for testing
cask "google-chrome"	# Chrome
cask "firefox"				# Firefox

# Communication
cask "discord"		# Discord
cask "signal"			# Secure messaging

# Fonts
cask "font-monaspace-nerd-font"	# Monospace font including developer icons
cask "font-monaspace"

# App Store Apps
mas "Things 3", id: 904_280_696 # To-dos
